IDEA Open Model
ConcreteCheckResultOverallItem Class
Compatible with IDEA StatiCa Beta 20.0
 Overal check item
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultOverallItem
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ConcreteCheckResultOverallItem
Public Class ConcreteCheckResultOverallItem
The ConcreteCheckResultOverallItem type exposes the following members.
Constructors
Name | Description
ConcreteCheckResultOverallItem
 Constructor
Top
Properties
Name | Description
CheckValue
 calculated limited value, calculated as strain to limit strain
Result
 check result passed/failed
ResultType
 Check result type
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace